#### Importing libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score,confusion_matrix

#### Importing the dataset

In [7]:
df=pd.read_csv("Social_Network_Ads.csv")
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [8]:
df.shape

(400, 5)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [12]:
df.isna().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

#### converting categorical values into numerical values

In [14]:
dataset=pd.get_dummies(df,drop_first=True)
dataset.head()

    User ID  Age  EstimatedSalary  Purchased  Gender_Male
0  15624510   19            19000          0            1
1  15810944   35            20000          0            1
2  15668575   26            43000          0            0
3  15603246   27            57000          0            0
4  15804002   19            76000          0            1

In [17]:
dataset["Purchased"].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [18]:
dataset=dataset.drop("User ID",axis=1)
dataset

     Age  EstimatedSalary  Purchased  Gender_Male
0     19            19000          0            1
1     35            20000          0            1
2     26            43000          0            0
3     27            57000          0            0
4     19            76000          0            1
..   ...              ...        ...          ...
395   46            41000          1            0
396   51            23000          1            1
397   50            20000          1            0
398   36            33000          0            1
399   49            36000          1            0

[400 rows x 4 columns]

In [20]:
# Separating x and y
x=dataset.loc[:,['Age','EstimatedSalary','Gender_Male']].values
y=dataset.loc[:,["Purchased"]].values

In [21]:
# shape of x and y
print("Shape of x",x.shape)
print("Shape of y",y.shape)

Shape of x (400, 3)
Shape of y (400, 1)

In [22]:
# spliting the values into x_train and y_train
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25,random_state=0)

#### Feature scaling for better accuracy

In [23]:
sc=StandardScaler()
x_train=sc.fit_transform(x_train)
x_test=sc.transform(x_test)

#### model building

In [24]:
model=LogisticRegression()

In [25]:
model.fit(x_train,y_train)

C:\Users\Sagar Guttal\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression()

In [27]:
# prediction
y_prediction=model.predict(x_test)

#### model evaluation

In [30]:
accuracy=accuracy_score(y_test,y_prediction)
accuracy*100

90.0

In [31]:
confusion_matrix(y_test,y_prediction)

array([[65,  3],
       [ 7, 25]], dtype=int64)